export const errorMessageTw = {
  411: '請重新登入',
  412: '請重新登入',
  413: '請重新登入',
  414: '請重新登入',
  419: '請重新登入',
  420: '請重新登入',
  421: '請重新登入',

  500: '系統錯誤',
  501: '缺少必要參數',
  502: '檔案格式錯誤',
  516: '上傳的檔案數量超過限制',
  522: '代幣不足',
  523: '歌長超過',
  524: '上傳檔案長度或格式錯誤',
  601: '缺少必要參數',
  607: '分析的檔案不存在',
  616: '分析的檔案數量超過限制',
  622: '代幣不足',
  623: '時間長度超過限制',
  624: '分析的檔案含有多個錯誤',
  701: '缺少必要參數',
  702: '參數格式錯誤',
  707: '檔案不存在',

  formatError:
    '檔案格式錯誤, 我們僅提供 mp3, wav, m4a, mp4 及 mov 格式檔案上傳',
  sizeError: '單一檔案大小不得超過1GB',
  limitError: '上傳的檔案不得多於五首',
  longError: '請上傳小於30分鐘的檔案',
  missError: '請先上傳檔案',
  startAnalyze:
    '即將開始分析檔案，您將在不久後收到分析好的檔案，謝謝您的耐心等候',
  point: '點',
  require: ''
}
